Autodesk.Revit.DB.SpatialElementBoundaryOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SpatialElementBoundaryOptions.SpatialElementBoundaryLocation
The boundary of spatial element for geometry calculation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundaryOptions.StoreFreeBoundaryFaces
Indicates whether to include the free boundary faces in the result.
Remarks:
A free subface is a portion of a spatial element face that is not (partially) coincident with a face of a bounding element.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundaryOptions.#ctor
Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundaryOptions
Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.
Since:
2012